Ran Plan for project: `apps` dir: `terragrunt-integration/terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
>>>> PLANNING CHANGES <<<<

/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/26/default/terragrunt-integration/terraform

22:15:28.703 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.11.4` instead.
22:15:28.718 INFO   The runner at . will be processed in the following order for command plan:
Group 1
- Unit .
- Unit ./modules/random

Group 2
- Unit ./app1
- Unit ./app2


22:15:29.220 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/GzmnpbzSgGUw9rpp1BmX_6PkWtw/EmOz7tU99-tcY8ijUr4G8-f3f2k
22:15:29.257 INFO   [modules/random] terraform1.11.4: Initializing the backend...
22:15:29.258 INFO   terraform1.11.4: Initializing the backend...
22:15:29.258 INFO   terraform1.11.4: Initializing provider plugins...
22:15:29.258 INFO   terraform1.11.4: - Finding latest version of hashicorp/random...
22:15:29.258 INFO   [modules/random] terraform1.11.4: Initializing provider plugins...
22:15:29.258 INFO   [modules/random] terraform1.11.4: - Finding latest version of hashicorp/random...
22:15:30.317 INFO   [modules/random] terraform1.11.4: - Installing hashicorp/random v3.7.2...
22:15:30.328 INFO   terraform1.11.4: - Installing hashicorp/random v3.7.2...
22:15:31.495 INFO   [modules/random] terraform1.11.4: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
22:15:31.495 INFO   [modules/random] terraform1.11.4: Terraform has created a lock file .terraform.lock.hcl to record the provider
22:15:31.495 INFO   [modules/random] terraform1.11.4: selections it made above. Include this file in your version control repository
22:15:31.495 INFO   [modules/random] terraform1.11.4: so that Terraform can guarantee to make the same selections by default when
22:15:31.495 INFO   [modules/random] terraform1.11.4: you run "terraform init" in the future.
22:15:31.495 INFO   [modules/random] terraform1.11.4: Terraform has been successfully initialized!
22:15:31.678 STDOUT [modules/random] terraform1.11.4: Terraform used the selected providers to generate the following execution
22:15:31.678 STDOUT [modules/random] terraform1.11.4: plan. Resource actions are indicated with the following symbols:
22:15:31.678 STDOUT [modules/random] terraform1.11.4:   + create
22:15:31.678 STDOUT [modules/random] terraform1.11.4: Terraform will perform the following actions:
22:15:31.678 STDOUT [modules/random] terraform1.11.4:   # random_string.base_bucket_name will be created
22:15:31.678 STDOUT [modules/random] terraform1.11.4:   + resource "random_string" "base_bucket_name" {
22:15:31.679 STDOUT [modules/random] terraform1.11.4:       + id          = (known after apply)
22:15:31.679 STDOUT [modules/random] terraform1.11.4:       + length      = 4
22:15:31.679 STDOUT [modules/random] terraform1.11.4:       + lower       = true
22:15:31.679 STDOUT [modules/random] terraform1.11.4:       + min_lower   = 0
22:15:31.679 STDOUT [modules/random] terraform1.11.4:       + min_numeric = 0
22:15:31.679 STDOUT [modules/random] terraform1.11.4:       + min_special = 0
22:15:31.679 STDOUT [modules/random] terraform1.11.4:       + min_upper   = 0
22:15:31.679 STDOUT [modules/random] terraform1.11.4:       + number      = false
22:15:31.679 STDOUT [modules/random] terraform1.11.4:       + numeric     = false
22:15:31.679 STDOUT [modules/random] terraform1.11.4:       + result      = (known after apply)
22:15:31.679 STDOUT [modules/random] terraform1.11.4:       + special     = false
22:15:31.679 STDOUT [modules/random] terraform1.11.4:       + upper       = true
22:15:31.679 STDOUT [modules/random] terraform1.11.4:     }
22:15:31.679 STDOUT [modules/random] terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
22:15:31.679 STDOUT [modules/random] terraform1.11.4: 
22:15:31.679 STDOUT [modules/random] terraform1.11.4: Changes to Outputs:
22:15:31.679 STDOUT [modules/random] terraform1.11.4:   + base_bucket_name = (known after apply)
22:15:31.774 INFO   terraform1.11.4: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
22:15:31.774 INFO   terraform1.11.4: Terraform has created a lock file .terraform.lock.hcl to record the provider
22:15:31.774 INFO   terraform1.11.4: selections it made above. Include this file in your version control repository
22:15:31.774 INFO   terraform1.11.4: so that Terraform can guarantee to make the same selections by default when
22:15:31.774 INFO   terraform1.11.4: you run "terraform init" in the future.
22:15:31.774 INFO   terraform1.11.4: Terraform has been successfully initialized!
22:15:31.912 STDOUT terraform1.11.4: Terraform used the selected providers to generate the following execution
22:15:31.912 STDOUT terraform1.11.4: plan. Resource actions are indicated with the following symbols:
22:15:31.912 STDOUT terraform1.11.4:   + create
22:15:31.912 STDOUT terraform1.11.4: Terraform will perform the following actions:
22:15:31.912 STDOUT terraform1.11.4:   # random_string.base_bucket_name will be created
22:15:31.912 STDOUT terraform1.11.4:   + resource "random_string" "base_bucket_name" {
22:15:31.912 STDOUT terraform1.11.4:       + id          = (known after apply)
22:15:31.912 STDOUT terraform1.11.4:       + length      = 4
22:15:31.912 STDOUT terraform1.11.4:       + lower       = true
22:15:31.912 STDOUT terraform1.11.4:       + min_lower   = 0
22:15:31.912 STDOUT terraform1.11.4:       + min_numeric = 0
22:15:31.912 STDOUT terraform1.11.4:       + min_special = 0
22:15:31.912 STDOUT terraform1.11.4:       + min_upper   = 0
22:15:31.912 STDOUT terraform1.11.4:       + number      = false
22:15:31.912 STDOUT terraform1.11.4:       + numeric     = false
22:15:31.912 STDOUT terraform1.11.4:       + result      = (known after apply)
22:15:31.912 STDOUT terraform1.11.4:       + special     = false
22:15:31.912 STDOUT terraform1.11.4:       + upper       = true
22:15:31.912 STDOUT terraform1.11.4:     }
22:15:31.912 STDOUT terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
22:15:31.912 STDOUT terraform1.11.4: 
22:15:31.912 STDOUT terraform1.11.4: Changes to Outputs:
22:15:31.912 STDOUT terraform1.11.4:   + base_bucket_name = (known after apply)
22:15:31.922 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/GzmnpbzSgGUw9rpp1BmX_6PkWtw/EmOz7tU99-tcY8ijUr4G8-f3f2k
22:15:31.955 INFO   terraform1.11.4: Initializing the backend...
22:15:31.969 INFO   terraform1.11.4: Initializing provider plugins...
22:15:31.969 INFO   terraform1.11.4: - Reusing previous version of hashicorp/random from the dependency lock file
22:15:32.257 INFO   terraform1.11.4: - Using previously-installed hashicorp/random v3.7.2
22:15:32.257 INFO   terraform1.11.4: Terraform has been successfully initialized!
22:15:32.299 WARN   [app2] Config ./commons.hcl is a dependency of ./app2/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
22:15:32.299 WARN   [app1] Config ./commons.hcl is a dependency of ./app1/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
22:15:32.300 INFO   [app2] Downloading Terraform configurations from ./modules/s3-bucket into ./app2/.terragrunt-cache/_KOkEl82ej-CAPZy9GpH8KNZ8NM/zZNcwkdTs5Qf0whbpLW5yacpAsw
22:15:32.300 INFO   [app1] Downloading Terraform configurations from ./modules/s3-bucket into ./app1/.terragrunt-cache/lEwxAfFZmbO6E3axC3xCybmNI8c/zZNcwkdTs5Qf0whbpLW5yacpAsw
22:15:32.329 INFO   [app1] terraform1.11.4: Initializing the backend...
22:15:32.330 INFO   [app1] terraform1.11.4: Initializing provider plugins...
22:15:32.330 INFO   [app1] terraform1.11.4: - Finding hashicorp/aws versions matching "~> 5.0"...
22:15:32.330 INFO   [app2] terraform1.11.4: Initializing the backend...
22:15:32.331 INFO   [app2] terraform1.11.4: Initializing provider plugins...
22:15:32.331 INFO   [app2] terraform1.11.4: - Finding hashicorp/aws versions matching "~> 5.0"...
22:15:33.364 INFO   [app2] terraform1.11.4: - Installing hashicorp/aws v5.100.0...
22:15:33.387 INFO   [app1] terraform1.11.4: - Installing hashicorp/aws v5.100.0...
22:16:00.973 INFO   [app1] terraform1.11.4: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
22:16:00.973 INFO   [app1] terraform1.11.4: Terraform has created a lock file .terraform.lock.hcl to record the provider
22:16:00.974 INFO   [app1] terraform1.11.4: selections it made above. Include this file in your version control repository
22:16:00.974 INFO   [app1] terraform1.11.4: so that Terraform can guarantee to make the same selections by default when
22:16:00.974 INFO   [app1] terraform1.11.4: you run "terraform init" in the future.
22:16:00.974 INFO   [app1] terraform1.11.4: Terraform has been successfully initialized!
22:16:03.606 INFO   [app2] terraform1.11.4: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
22:16:03.606 INFO   [app2] terraform1.11.4: Terraform has made some changes to the provider dependency selections recorded
22:16:03.606 INFO   [app2] terraform1.11.4: in the .terraform.lock.hcl file. Review those changes and commit them to your
22:16:03.606 INFO   [app2] terraform1.11.4: version control system if they represent changes you intended to make.
22:16:03.606 INFO   [app2] terraform1.11.4: Terraform has been successfully initialized!
22:16:04.249 STDOUT [app1] terraform1.11.4: Terraform used the selected providers to generate the following execution
22:16:04.249 STDOUT [app1] terraform1.11.4: plan. Resource actions are indicated with the following symbols:
22:16:04.249 STDOUT [app1] terraform1.11.4:   + create
22:16:04.249 STDOUT [app1] terraform1.11.4: Terraform will perform the following actions:
22:16:04.249 STDOUT [app1] terraform1.11.4:   # aws_s3_bucket.this will be created
22:16:04.249 STDOUT [app1] terraform1.11.4:   + resource "aws_s3_bucket" "this" {
22:16:04.249 STDOUT [app1] terraform1.11.4:       + acceleration_status         = (known after apply)
22:16:04.249 STDOUT [app1] terraform1.11.4:       + acl                         = "private"
22:16:04.249 STDOUT [app1] terraform1.11.4:       + arn                         = (known after apply)
22:16:04.249 STDOUT [app1] terraform1.11.4:       + bucket                      = "app1-new9-dev-base-name"
22:16:04.250 STDOUT [app1] terraform1.11.4:       + bucket_domain_name          = (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + bucket_prefix               = (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + bucket_regional_domain_name = (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + force_destroy               = false
22:16:04.250 STDOUT [app1] terraform1.11.4:       + hosted_zone_id              = (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + id                          = (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + object_lock_enabled         = (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + policy                      = (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + region                      = (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + request_payer               = (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + tags_all                    = (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + website_domain              = (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + website_endpoint            = (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + cors_rule (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + grant (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + lifecycle_rule (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + logging (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + object_lock_configuration (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + replication_configuration (known after apply)
22:16:04.250 STDOUT [app1] terraform1.11.4:       + server_side_encryption_configuration (known after apply)
22:16:04.251 STDOUT [app1] terraform1.11.4:       + versioning (known after apply)
22:16:04.251 STDOUT [app1] terraform1.11.4:       + website (known after apply)
22:16:04.251 STDOUT [app1] terraform1.11.4:     }
22:16:04.251 STDOUT [app1] terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
22:16:04.251 STDOUT [app1] terraform1.11.4: 
22:16:04.251 STDOUT [app1] terraform1.11.4: Changes to Outputs:
22:16:04.251 STDOUT [app1] terraform1.11.4:   + bucket_arn = (known after apply)
22:16:04.251 STDOUT [app1] terraform1.11.4: ╷
22:16:04.251 STDOUT [app1] terraform1.11.4: │ Warning: Argument is deprecated
22:16:04.251 STDOUT [app1] terraform1.11.4: │ 
22:16:04.251 STDOUT [app1] terraform1.11.4: │   with aws_s3_bucket.this,
22:16:04.251 STDOUT [app1] terraform1.11.4: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
22:16:04.251 STDOUT [app1] terraform1.11.4: │   17:   acl    = "private"
22:16:04.251 STDOUT [app1] terraform1.11.4: │ 
22:16:04.251 STDOUT [app1] terraform1.11.4: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
22:16:04.251 STDOUT [app1] terraform1.11.4: │ 
22:16:04.251 STDOUT [app1] terraform1.11.4: │ (and one more similar warning elsewhere)
22:16:04.251 STDOUT [app1] terraform1.11.4: ╵
22:16:06.304 STDOUT [app2] terraform1.11.4: Terraform used the selected providers to generate the following execution
22:16:06.304 STDOUT [app2] terraform1.11.4: plan. Resource actions are indicated with the following symbols:
22:16:06.304 STDOUT [app2] terraform1.11.4:   + create
22:16:06.304 STDOUT [app2] terraform1.11.4: Terraform will perform the following actions:
22:16:06.304 STDOUT [app2] terraform1.11.4:   # aws_s3_bucket.this will be created
22:16:06.304 STDOUT [app2] terraform1.11.4:   + resource "aws_s3_bucket" "this" {
22:16:06.304 STDOUT [app2] terraform1.11.4:       + acceleration_status         = (known after apply)
22:16:06.304 STDOUT [app2] terraform1.11.4:       + acl                         = "private"
22:16:06.304 STDOUT [app2] terraform1.11.4:       + arn                         = (known after apply)
22:16:06.304 STDOUT [app2] terraform1.11.4:       + bucket                      = "app2-dev-base-name"
22:16:06.305 STDOUT [app2] terraform1.11.4:       + bucket_domain_name          = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + bucket_prefix               = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + bucket_regional_domain_name = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + force_destroy               = false
22:16:06.305 STDOUT [app2] terraform1.11.4:       + hosted_zone_id              = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + id                          = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + object_lock_enabled         = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + policy                      = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + region                      = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + request_payer               = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + tags_all                    = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + website_domain              = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + website_endpoint            = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + cors_rule (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + grant (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + lifecycle_rule (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + logging (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + object_lock_configuration (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + replication_configuration (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + server_side_encryption_configuration (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + versioning (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:       + website (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4:     }
22:16:06.305 STDOUT [app2] terraform1.11.4: Plan: 1 to add, 0 to change, 0 to destroy.
22:16:06.305 STDOUT [app2] terraform1.11.4: 
22:16:06.305 STDOUT [app2] terraform1.11.4: Changes to Outputs:
22:16:06.305 STDOUT [app2] terraform1.11.4:   + bucket_arn = (known after apply)
22:16:06.305 STDOUT [app2] terraform1.11.4: ╷
22:16:06.305 STDOUT [app2] terraform1.11.4: │ Warning: Argument is deprecated
22:16:06.305 STDOUT [app2] terraform1.11.4: │ 
22:16:06.305 STDOUT [app2] terraform1.11.4: │   with aws_s3_bucket.this,
22:16:06.305 STDOUT [app2] terraform1.11.4: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
22:16:06.305 STDOUT [app2] terraform1.11.4: │   17:   acl    = "private"
22:16:06.305 STDOUT [app2] terraform1.11.4: │ 
22:16:06.305 STDOUT [app2] terraform1.11.4: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
22:16:06.305 STDOUT [app2] terraform1.11.4: │ 
22:16:06.305 STDOUT [app2] terraform1.11.4: │ (and one more similar warning elsewhere)
22:16:06.305 STDOUT [app2] terraform1.11.4: ╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p apps
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://890ca2a7b7e7.ngrok-free.app/lock?id=jefersonlemos%252Fatlantis-playground%252Fterragrunt-integration%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p apps
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```